
export const informationsAboutPortfolio = `

    موقع ويب بستايل فضائي يحتوي على نجوم جميلة و ثقب اسود جميل و موسيقى انترستلر تعمل في الخلفية لتعطي رونقا بديع يوحي بالكون و الفضاء

    الاقسام المتاحة مع الترتيب:

    - hero : حيث يتمثل في ملخص قصير حول الموقع
    - skills : حيث توجد مهارات فارس
    - aboutMe : حيث يوجد بعض المعلومات التفصيلية حول فارس
    - projects : حيث توجد مشاريع فارس التي عمل عليها 
    - contactMe: حيث توجد خانة ملئ البيانات التالية (الاسم الكامل , الايميل , عنوان المشروع المراد من فارس انجازه , فقرة قصيرة اختيارية تلخص المطلوب)


`;