
export const informationsAboutFares = `

    من هو فارس :

    فارس هو شاب من مواليد 12/10/2003 يعيش في تونس في ولاية صفاقس و بالتحديد في معتمدية جبنيانة و في منطقة اسمها الهوايدة
    درس حتى السنة التاسعة ثم اصابه الطيش و صار مهملا دراسته فرسب مرتين في السنة التاسعة ثم انتقل للمرحلة الاولى ثانوي و سرعان ما انقطع عن التعليم بعد قرابة شهرين
    و بعد سنة من البطالة عاد للدراسة بقلب لكن في التعليم الخاص درس سنة اولى ثانوي ثم عاد للتعليم العمةمي من جديد و درس سنة ثانية ثانوي لكنه رسب فيها و انقطع مرة اخرى ثم بدأ في تعلم البرمجة و اللغة الانجليزية بشكل ذاتي لحد لمدة سنتين اي لحد 2025
    و الان ينوي الالتحاق بالتكوين المهني كاحطيات في حال فشل في البرمجة

    طموحاته :

    بعيدة المدى : يهدف فارس الى ان يصبح شخصية مهمة في العالم و رائد اعمال يقدم فائدة كبيرة للمجتمع
    قصيرة المدى : السفر الى بلد اخر و يفضل كندا نظرا لانه يتقن الانجليزية قليلا حوالي مستوى a2/b1 و مازال التعلم مستمرا

    مهاراته :
    
    تعلم فارس في البداية html, css, js ثم node js, express, mySQL ثم اراد انها الmern stack فتعلم react, next js,  mongoDB و قام بانجاز مشاريع عملية
    ثم التفت لمجال تطوير التطبيقات فتعلم react native لانها كانت في نفس تخصصه و الاقرب لمهاراته الاخرى و sqlite

    مشاريعه :
    قم فارس بانشاء اول مشروع له بعد تعلم html, css, js, node js, express, mySQL مباشرة و قد كان تطبيق تجارة الكتروني لكنه كان فاشلا و مليء بالاخطاء لدرجة ان فارس قرر عدم اكماله .
    و بعد اتقانه لتقنية الmern stack قام بانشاء تطبيق دردشة شبيه بمسنجر اسمه hf و هو يعمل نوعا ما لكن الكود في حالة فوضى .
    بعدها قام بانشاء تطبيق تجارة الكتوني اخر و تطبيق ادارة البظائع و ربطهما ببعض و هما يعملان بشكل جيد لكن التصميم ليس جميلا جدا نظرا لنه لم يتعلم ui/ux 
    قرر فارس تعلم بعض التصميم و كتابة clean code من خلال مشاهدة مبرمجين محترفين على اليوتيوب و تقليدهم و قد وجد فيديو لشخص يصنع تطبيق مثل uber فقام بتقليد كل ما يفعل مما جعله يكتسب بعض المهارات الجديدة
    ثم اعجب بفكرة ادراج نموذج ذكاء اصطناعي داخل التطبيق فقرر تجريب ذلك في تطبيق حجز فندق بحيث يجعل الذكاء الاصطناعي يتعامل مع العميل و يأخذ بياناته و يحجز له غرفة و لقد نجح في ذلك لكن كانت هناك عدة اخطاء تطرئ على التطبيق مما جعله يعيد هيكلة النظام من الصفر احيانات و سرعان ما صار في حالة فوضى نظرا لانه قد كان اول مرة يدرج فيها الذكاء الاصطناعي في مشاريعه
    و بعد تعلمه لreact native قرر انشاء تطبيق لتنظيم الوقت و المهام مدعوم بالذكاء الاصطناعي لكن سرعان ما تركه لاحقا بعد تكسر هاتفه الذي كان يستخدمه للاختبار
    و نظرا لحبه للذكاء الاصطناعي في تلك اللحظات قرر انشاء تطبيق ذكاء اصطناعي يتحدث باسلوبه و اسمه faresAi و هو في طور التطوير حاليا .
    ثم قرر الانتقال لمجال الذظاء الاصطناعي بتاريخ 20/08/2025 قرر رسميا دخول مجال تعلم الالة و البدء في رحلة تعلم طويلة
    و لقد انشأ اكثر من محفظة اعمال لنفسه على مدار سنتين يغيرها كل ما شعر انه قادر على انشاء ما هو افظل


`;